In [2]:
import pandas as pd
pd.__version__

'0.25.1'

In [3]:
array = pd.Series([1,2,3,4,5])
array

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
array + array

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [6]:
array.add(array)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [7]:
df = pd.DataFrame(array)
df

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
df[0]

0    1
1    2
2    3
3    4
4    5
Name: 0, dtype: int64

In [9]:
df.iloc[0]

0    1
Name: 0, dtype: int64

In [10]:
df.iloc[0,0]

1

In [11]:
df[0][0]

1

In [12]:
df = pd.DataFrame(data=[[0, 1, 2], [3, 4, 5]], index=list('ab'), columns=list('cde'))
df

   c  d  e
a  0  1  2
b  3  4  5

In [14]:
type(df.index)

pandas.core.indexes.base.Index

In [15]:
type(df.columns)

pandas.core.indexes.base.Index

In [16]:
type(df.values)

numpy.ndarray

In [17]:
type(df.iloc)

pandas.core.indexing._iLocIndexer

In [18]:
type(df.loc)

pandas.core.indexing._LocIndexer

In [19]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                 columns = list('abc'))
df_a = df

In [20]:
df_a['a'] = 100
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [21]:
df

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [22]:
id(df),id(df_a)

(4662992656, 4662992656)

In [23]:
df.values.base is df_a.values.base

True

In [25]:
df_b = df + 99
df_b

     a    b    c
0  199  101  102
1  199  104  105
2  199  107  108

In [26]:
id(df_b),id(df)

(4500548816, 4662992656)

In [27]:
df_b.values.base is df.values.base

False

In [28]:
df

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [29]:
import numpy as np
s1 = pd.Series(index=list('abcd'),data=np.arange(4))
s2 = s1
s1 is s2

True

In [30]:
s3 = s1.copy()
s1 is s3

False

In [32]:
pd.Series.__getitem__

In [33]:
pd.DataFrame.__getitem__

In [34]:
pd.Index.__getitem__

In [35]:
pd.MultiIndex.__getitem__

In [37]:
df = pd.DataFrame([[1, 2, 3, 4], [5, 6, 7, 8]], index = ['a','b'], 
                  columns=['가', '나', '다', '라'])

In [38]:
df.loc.__getitem__

In [39]:
df.iloc.__getitem__

In [40]:
df

   가  나  다  라
a  1  2  3  4
b  5  6  7  8

In [41]:
df['나']

a    2
b    6
Name: 나, dtype: int64

In [42]:
df.__getitem__('나')

a    2
b    6
Name: 나, dtype: int64

In [43]:
series = df['나']
series

a    2
b    6
Name: 나, dtype: int64

In [44]:
series['a']

2

In [45]:
series.__getitem__('a')

2

In [47]:
series.__getitem__(series > 3)

b    6
Name: 나, dtype: int64

In [49]:
df.__getitem__(df > 3)

     가    나    다  라
a  NaN  NaN  NaN  4
b  5.0  6.0  7.0  8

In [50]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=list('abc'))
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [52]:
df1 = pd.DataFrame([[3,3,3],[3,3,3],[3,3,3]],columns=list('abc'))
df1

   a  b  c
0  3  3  3
1  3  3  3
2  3  3  3

In [53]:
df+3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [54]:
df + df1

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [55]:
type(df.__add__)

method

In [56]:
type(df.__add__.__func__)

function

In [57]:
type(df.add)

method

In [58]:
type(df.add.__func__)

function

In [59]:
df.__add__ is df.add.__func__

False

In [3]:
import numpy as np
df_na = pd.DataFrame([1,2,np.nan])
df_na

     0
0  1.0
1  2.0
2  NaN

In [4]:
df_na.sum()

0    3.0
dtype: float64

In [5]:
df_na.sum(skipna=False)

0   NaN
dtype: float64

In [6]:
df_na < 3

       0
0   True
1   True
2  False

In [7]:
df_na < np.nan

       0
0  False
1  False
2  False

In [8]:
df_four = pd.Series([1,2,3,4])
df_four

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
df_four.sum(axis=0)

10

In [10]:
df_dax = pd.DataFrame([[1,2,3,4],[5,6,7,8]])
df_dax

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [11]:
df_dax.sum(axis=0)

0     6
1     8
2    10
3    12
dtype: int64

In [12]:
df_dax.sum(axis=1)

0    10
1    26
dtype: int64

In [13]:
df_1 = pd.DataFrame(np.random.randint(1, 10,(3, 3)), columns=list('ABC'))
df_1

   A  B  C
0  7  3  3
1  9  1  6
2  4  7  8

In [14]:
df_2 = pd.DataFrame(np.random.randint(1, 10,(3, 3)), columns=list('CAB'))
df_2

   C  A  B
0  2  1  2
1  5  5  5
2  2  1  7

In [15]:
np.log(df_2)

          C         A         B
0  0.693147  0.000000  0.693147
1  1.609438  1.609438  1.609438
2  0.693147  0.000000  1.945910

In [16]:
df_1 + df_2

    A   B   C
0   8   5   5
1  14   6  11
2   5  14  10

In [17]:
df_3 = pd.DataFrame(np.random.randint(1, 10, (3,2)), columns=list('CB'))
df_3

   C  B
0  4  7
1  4  7
2  4  4

In [18]:
df_1 + df_3

    A   B   C
0 NaN  10   7
1 NaN   8  10
2 NaN  11  12

In [19]:
import chardet
def find_encoding(fname):
    r_file = open(fname, 'rb').read()
    result = chardet.detect(r_file)
    charenc = result['encoding']
    return charenc

In [20]:
my_encoding = find_encoding('../Pandas/example.csv')
df_1 = pd.read_csv('../Pandas/example.csv', encoding=my_encoding)
my_encoding

'UTF-8-SIG'

In [21]:
df_1.head()

   학년       학과   이름   성적
0   4   컴퓨터공학과  김소혜  4.5
1   3  정보통신공학과  김도연  4.4
2   4  정보통신공학과  최유정  4.3
3   4   영어영문학과  강미나  4.2
4   3     경영학과  유연정  4.3

In [22]:
df_1.head(2)

   학년       학과   이름   성적
0   4   컴퓨터공학과  김소혜  4.5
1   3  정보통신공학과  김도연  4.4

In [25]:
df_3 = pd.read_csv('../Pandas/example.csv', engine='python')
df_3.head(3)

                학년
4 컴퓨터공학과  김소혜  4.5
3 정보통신공학과 김도연  4.4
4 정보통신공학과 최유정  4.3

In [27]:
df_1.head()

   학년       학과   이름   성적
0   4   컴퓨터공학과  김소혜  4.5
1   3  정보통신공학과  김도연  4.4
2   4  정보통신공학과  최유정  4.3
3   4   영어영문학과  강미나  4.2
4   3     경영학과  유연정  4.3

In [28]:
df_1.drop('성적', axis=1).head()

   학년       학과   이름
0   4   컴퓨터공학과  김소혜
1   3  정보통신공학과  김도연
2   4  정보통신공학과  최유정
3   4   영어영문학과  강미나
4   3     경영학과  유연정